sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.7.57"
         xsi:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.57/schema/PACK.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32CM-PL_DFP</name>
   <description overview="./OVERVIEW.md">Microchip PIC32CM-PL Series Device Support</description>
   <supportContact>https://www.microchip.com/en-us/support</supportContact>
   <license>LICENSE.txt</license>
   <licenseSets>
      <licenseSet id="all" default="true" gating="false">
         <license name="LICENSE.txt"
                  title="Apache License, Version 2.0"
                  spdx="Apache-2.0"
                  url="https://www.apache.org/licenses/LICENSE-2.0"/>
      </licenseSet>
   </licenseSets>
   <releases>
      <release version="1.5.437" date="2026-07-15">
      - Switched from single flashinfo with blocks and gaps to multiple discrete flashinfo entries for improved flash programming compatibility.
      - Added protection against accidental permanent device lock when programming DAL=0.
      - Fixed csolution blank project template to correctly locate cproject file.
      </release>
      <release version="1.4.418" date="2026-05-27">
	  - Fixed debug script reference.	  
	  </release>
      <release version="1.3.414" date="2026-05-06">
      - Enabled use of define DISABLE_CMSIS to not in CMSIS-Core includes.
      - Improved SVD (device peripheral description XML) compliance with CMSIS standard.
      - The SystemCoreClockUpdate() function in system_&lt;device&gt;.c file now update SystemCoreClock to the current clock frequency.
      - Defined the ROM Configuration (ROMCFG) in headerfiles and XML description.
      - Added support for PIC32CM1216PL10028, PIC32CM1216PL10032, PIC32CM1216PL10048, PIC32CM1216PL10064.
      - Added support for PIC32CM3204PL10020, PIC32CM3204PL10028, PIC32CM3204PL10032.
      </release>
      <release version="1.2.329" date="2026-02-17">
		  - DEVXML-7483 Interrupt handler in startup_(device).c changed: SVCall_Handler changed -&gt; SVC_Handler and NonMaskableInt_Handler -&gt; NMI_Handler.
	  </release>
      <release version="1.1.324" date="2026-01-15">
		  - DEVXML-7553 Fixed breakpoint setting on Curiosity Nano.
		  - Improved programming speed.
	  </release>
      <release version="1.0.313" date="2025-12-03">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32CM-PL</keyword>
      <keyword>AVR-DA</keyword>
      <keyword>AVR</keyword>
      <keyword>8-bit</keyword>
      <keyword>64KB Flash</keyword>
      <keyword>PTC</keyword>
      <keyword>Peripheral Touch Controller</keyword>
      <keyword>Capacitive Touch</keyword>
      <keyword>12-bit differential ADC</keyword>
      <keyword>Comparator</keyword>
      <keyword>Zero Cross Detect</keyword>
      <keyword>ZCD</keyword>
      <keyword>10-bit DAC</keyword>
      <keyword>PWM</keyword>
      <keyword>Timer/Counter</keyword>
      <keyword>MIPS</keyword>
      <keyword>24 MHz</keyword>
      <keyword>PLL</keyword>
      <keyword>32</keyword>
      <keyword>Bit</keyword>
      <keyword>Microcontrollers</keyword>
      <keyword>32-Bit Microcontrollers</keyword>
      <keyword>Touch</keyword>
      <keyword>MotorControl</keyword>
      <keyword>Functional Safety Ready</keyword>
      <keyword>Motor Control</keyword>
      <keyword>Microcontrollers And Processors</keyword>
      <keyword>UltraLowPower</keyword>
      <keyword>Ultra Low Power</keyword>
      <keyword>8</keyword>
      <keyword>8-Bit Microcontrollers</keyword>
   </keywords>
   <requirements>
      <packages>
         <package vendor="ARM" name="CMSIS"/>
      </packages>
   </requirements>
   <devices>
      <family Dfamily="PIC32CM-PL" Dvendor="Microchip:3">
         <debugvars version="1.0.0" configfile="debug/PIC32CM-PL.dbgconf">
            __var AIRCR_Addr = 0xE000ED0C;
            __var DHCSR_Addr = 0xE000EDF0;
            __var DEMCR_Addr = 0xE000EDFC;
            __var DCRSR_Addr = 0xE000EDF4;
            __var DCRDR_Addr = 0xE000EDF8;
            __var DSU_BASE_ADDR = 0x41002000;
            __var DSU_STATUSA_ADDR = DSU_BASE_ADDR + 0x104;
            __var DSU_STATUSB_ADDR = DSU_BASE_ADDR + 0x108;
            __var DSU_DAL_ADDR = DSU_BASE_ADDR + 0x124;
            __var DSU_BCC0_ADDR = DSU_BASE_ADDR + 0x110;
            __var DSU_BCC1_ADDR = DSU_BASE_ADDR + 0x114;
            __var DSU_STATUSB_BCCD1_BIT = 0x2;
            __var DSU_STATUSB_BCCD0_BIT = 0x1;
            __var CRSTEXTBIT = 0x100;
            __var BREXTBIT = 0x10000; //BREXT bit in DSU STATUSA
            __var BOOTROM_STATUS_INITCHECK_OK = 0x3;
            __var BOOTROM_STATUS_BOOTOK = 0x4;
            __var BOOTROM_STATUS_OK = 0x9;
            __var BOOTROM_STATUS_CMD_VALID = 0x5;
            __var BOOTROM_STATUS_CHALLENGE = 0xB;
            __var DEBUGGER_CMD_EXIT  = 0x444247AA;
            __var DEBUGGER_CMD_IMODE = 0x44424755;
            __var NVMCTRL_INTFLAG_ADDR = 0x41004014;
            __var NVMCTRL_STATUS_ADDR = 0x4100401C;
            __var NVMCTRL_CTRLB_ADDR = 0x41004004;
            __var FP_CTRL_Addr = 0xE0002000;
            __var FP_COMP0_Addr = 0xE0002008;
            __var FPB_KEY = 0x00000002;
            __var FPB_ENABLE = 0x00000001;
            __var FPB_REPLACE = 0xC0000000;

            __var RAM_BUFFER = 0x20000000;
        </debugvars>
         <sequences>
            <sequence name="ResetSystem">
               <block>
                    Sequence("ResetAndHalt");
                </block>
            </sequence>
            <sequence name="ResetHardware">
               <block>
                    Sequence("ResetAndHalt");
                </block>
            </sequence>
            <sequence name="ResetProcessor">
               <block>
                    Sequence("ResetAndHalt");
                </block>
            </sequence>
            <sequence name="ResetAndHalt">
               <block>
                    Sequence("ResetToPark");
                    Sequence("ReleaseBREXT");
                </block>
            </sequence>
            <sequence name="DebugPortSetup">
               <block>
                    __var isSWJ    = ((__protocol &amp; 0x00010000) != 0);
                    __var protType = __protocol &amp; 0x0000FFFF;
                </block>
               <!-- JTAG Protocol -->
               <control if="protType == 1">
                  <control if="isSWJ">
                     <block>
                            // Ensure current debug interface is in reset state
                            DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                        
