sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
                            // Execute SWJ-DP Switch Sequence SWD to JTAG (0xE73C)
                            // Change if SWJ-DP uses deprecated switch code (0xAEAE)
                            DAP_SWJ_Sequence(16, 0xE73C);
                        
                            // Ensure JTAG interface is reset
                            DAP_SWJ_Sequence(6, 0x3F);
                        </block>
                  </control>
                  <block>
                        // JTAG "Soft" Reset
                        DAP_JTAG_Sequence(6, 1, 0x3F);
                        DAP_JTAG_Sequence(1, 0, 0x01);
                    </block>
               </control>
               <!-- SWD Protocol -->
               <control if="protType == 2">
                  <control if="isSWJ">
                     <block>
                            // Ensure current debug interface is in reset state
                            DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);
                        
                            // Execute SWJ-DP Switch Sequence JTAG to SWD (0xE79E)
                            // Change if SWJ-DP uses deprecated switch code (0xEDB6)
                            DAP_SWJ_Sequence(16, 0xE79E);
                        
                            // Enter SWD Line Reset State
                            DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                            DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                        </block>
                  </control>
                  <control if="!isSWJ">
                     <block>
                            // Enter SWD Line Reset State
                            DAP_SWJ_Sequence(51, 0x0007FFFFFFFFFFFF);  // &gt; 50 cycles SWDIO/TMS High
                            DAP_SWJ_Sequence(3,  0x00);                // At least 2 idle cycles (SWDIO/TMS Low)
                        </block>
                  </control>
                  <block>
                        // Read DPIDR to enable SWD interface (SW-DPv1 and SW-DPv2)
                        ReadDP(0x0);
                    </block>
               </control>
            </sequence>
            <sequence name="DebugPortStart">
               <block>
                    Sequence("DebugPortConnect");
                    Sequence("ResetAndHalt");
                </block>
            </sequence>
            <sequence name="DebugPortStop"/>
            <sequence name="DebugCoreStart"/>
            <sequence name="DebugCoreStop">
               <control if="Read32(0x0C000004) != 0xFFFFFFFF">
                  <block>
                        Write32(DHCSR_Addr, 0xA05F0000);
                    </block>
               </control>
            </sequence>
            <sequence name="DebugPortConnect">
               <block>
                    __var SW_DP_ABORT  = 0x0;
                    __var DP_CTRL_STAT = 0x4;
                    __var DP_SELECT    = 0x8;
                    __var powered_down = 0;

                    // Switch to DP Register Bank 
                    WriteDP(DP_SELECT, 0x00000000);
                    
                    // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
                    powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
                </block>
               <control if="powered_down">
                  <block>
                        // Request Debug/System Power-Up
                        WriteDP(DP_CTRL_STAT, 0x50000000);
                    </block>
                  <!-- Wait for Power-Up Request to be acknowledged -->
                  <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000"
                           timeout="1000000"/>
                  <!-- JTAG Specific Part of sequence -->
                  <control if="(__protocol &amp; 0xFFFF) == 1">
                     <block>
                            // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                            // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                            WriteDP(DP_CTRL_STAT, 0x50000F32);
                        </block>
                  </control>
                  <!-- SWD Specific Part of sequence -->
                  <control if="(__protocol &amp; 0xFFFF) == 2">
                     <block>
                            // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                            WriteDP(DP_CTRL_STAT, 0x50000F00);
                        
                            // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                            WriteDP(SW_DP_ABORT, 0x0000001E);
                        </block>
                  </control>
                  <block>
                        // clear AP register cache
                        ReadAP(0);
                    </block>
               </control>
            </sequence>
            <sequence name="ResetExtension">
               <block>
                    __var nReset      = 0x80;
                    __var SWCLK_TCK   = 0x01;
                    DAP_SWJ_Pins(0, nReset, 1000);
                    DAP_SWJ_Pins(0, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(SWCLK_TCK, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(0, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(SWCLK_TCK, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(0, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(SWCLK_TCK, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(0, SWCLK_TCK, 100);
                    DAP_SWJ_Pins(nReset, nReset, 1000);
                    
                    Sequence("DebugPortSetup");
                    Sequence("DebugPortConnect"); // ensure connect after reset extension
                </block>
               <control if="(__connection &amp; 0xF) == 0">
                  <block>
                        Message(0, "Failed to connect debugger after reset extension");
                    </block>
               </control>
            </sequence>
            <sequence name="ExitResetExtension">
               <block>
                    __var statusa = Read32(DSU_STATUSA_ADDR);
                </block>
               <control if="(statusa &amp; CRSTEXTBIT) == 0">
                  <block>
                        Message (0, "Device - could not enter reset extension");
                        __Result = -1;
                    </block>
               </control>
               <block>
                    Write32(DSU_STATUSA_ADDR, CRSTEXTBIT);
                    DAP_Delay(5000);
                    Write32(DSU_BCC0_ADDR, DEBUGGER_CMD_EXIT);
                    DAP_Delay(100000);
                    Sequence("WaitBootROMStatusBootOK");
                    __var dal = Read32(DSU_DAL_ADDR);
                    dal = 3 &amp; dal;
                    Write32(DHCSR_Addr, 0xa05f0003); // DBGKEY | C_DEBUGEN | C_HALT
                    Message(0, "DAL value: %X", dal);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ResetToPark">
               <block>
                    Sequence("ResetExtension");
                    Sequence("ExitResetExtension");
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ResetToIMode">
               <block>
                    Sequence("ResetExtension");
                    Sequence("EnterIMode");
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ReleaseBREXT">
               <block>
                    Write32(DSU_STATUSA_ADDR, BREXTBIT);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="NVMBusy">
               <control while="(Read32(NVMCTRL_INTFLAG_ADDR) &amp; 0x00000001) == 0"
                        timeout="1000000"/>
               <block>
                    __var nvm_intflag = Read32(NVMCTRL_INTFLAG_ADDR);
                </block>
               <control if="(nvm_intflag &amp; 0x2) != 0">
                  <block>
                        Message(0, "NVMCTRL Error Status: 0x%08X", Read32(NVMCTRL_STATUS_ADDR));
                        __Result = -1;
                    </block>
               </control>
               <block>
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="EnterIMode">
               <block>
                    __var statusa = Read32(DSU_STATUSA_ADDR);
                </block>
               <control if="(statusa &amp; CRSTEXTBIT) == 0">
                  <block>
                        Message (0, "Device - could not enter reset extension");
                        __Result = -1;
                    </block>
               </control>
               <block>
                    Write32(DSU_STATUSA_ADDR, CRSTEXTBIT);
                    Sequence("WaitBootROMStatusInitCheckOK");
                    Write32(DSU_BCC0_ADDR, DEBUGGER_CMD_IMODE);
                    Sequence("WaitBootROMStatusCommandValid");
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="WaitBootROMStatusBootOK">
               <block>
                    __var reply = 0;
                </block>
               <control while="reply != BOOTROM_STATUS_BOOTOK" timeout="500000">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; DSU_STATUSB_BCCD1_BIT) == 0"
                           timeout="10000"/>
                  <block>
                        reply = Read32(DSU_BCC1_ADDR);
                    </block>
               </control>
               <control if="reply != BOOTROM_STATUS_BOOTOK">
                  <block>
                        Message(0, "Timeout waiting for BOOTROM BOOTOK");
                    </block>
               </control>
            </sequence>
            <sequence name="WaitBootROMStatusInitCheckOK">
               <block>
                    __var reply = 0;
                </block>
               <control while="reply != BOOTROM_STATUS_INITCHECK_OK" timeout="500000">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; DSU_STATUSB_BCCD1_BIT) == 0"
                           timeout="10000"/>
                  <block>
                        reply = Read32(DSU_BCC1_ADDR);
                    </block>
               </control>
               <control if="reply != BOOTROM_STATUS_INITCHECK_OK">
                  <block>
                        Message(0, "Timeout waiting for BOOTROM INITCHECK OK");
                    </block>
               </control>
            </sequence>
            <sequence name="WaitBootROMStatusChallenge">
               <block>
                    __var reply = 0;
                </block>
               <control while="reply != BOOTROM_STATUS_CHALLENGE" timeout="500000">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; DSU_STATUSB_BCCD1_BIT) == 0"
                           timeout="10000"/>
                  <block>
                        reply = Read32(DSU_BCC1_ADDR);
                    </block>
               </control>
               <control if="reply != BOOTROM_STATUS_CHALLENGE">
                  <block>
                        Message(0, "Timeout waiting for BOOTROM CHALLENGE");
                    </block>
               </control>
            </sequence>
            <sequence name="WaitBootROMStatusCommandValid">
               <block>
                    __var reply = 0;
                </block>
               <control while="reply != BOOTROM_STATUS_CMD_VALID" timeout="500000">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; DSU_STATUSB_BCCD1_BIT) == 0"
                           timeout="10000"/>
                  <block>
                        reply = Read32(DSU_BCC1_ADDR);
                    </block>
               </control>
               <control if="reply != BOOTROM_STATUS_CMD_VALID">
                  <block>
                        Message(0, "Timeout waiting for BOOTROM CMD VALID");
                    </block>
               </control>
            </sequence>
            <sequence name="WaitBootROMStatusOK">
               <block>
                    __var reply = 0;
                </block>
               <control while="reply != BOOTROM_STATUS_OK" timeout="500000">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; DSU_STATUSB_BCCD1_BIT) == 0"
                           timeout="10000"/>
                  <block>
                        reply = Read32(DSU_BCC1_ADDR);
                    </block>
               </control>
               <control if="reply != BOOTROM_STATUS_OK">
                  <block>
                        Message(0, "Timeout waiting for BOOTROM OK");
                    </block>
               </control>
            </sequence>
            <sequence name="PreExecuteCMD">
               <block>
                    Write32(NVMCTRL_INTFLAG_ADDR, Read32(NVMCTRL_INTFLAG_ADDR));
                    Write32(NVMCTRL_STATUS_ADDR, 0xFFFF);
                    Sequence("NVMBusy");
                </block>
            </sequence>
            <sequence name="ExecuteCMD_NOOP">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA501);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ExecuteCMD_WFL">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA502);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ExecuteCMD_FLPER">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA508);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ExecuteCMD_EBOOTCFG">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA510);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ExecuteCMD_WBOOTCFG">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA511);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="ExecuteCMD_WLOCKREGION">
               <block>
                    Sequence("PreExecuteCMD");
                    Write32(NVMCTRL_CTRLB_ADDR, 0xA512);
                    __Result = 0;
                </block>
            </sequence>
            <sequence name="FlashInit"/>
            <sequence name="FlashUninit"/>
            <sequence name="FlashEraseSector">
               <control if="!(0x0D000400 &lt;= __FlashAddr &amp;&amp; __FlashAddr &lt;= 0x0D000500) &amp;&amp; !(0x0D000000 &lt;= __FlashAddr &amp;&amp; __FlashAddr &lt;= 0x0D000100)">
                  <block>
                        Message(0, "Erase Sector: 0x%08X..., size: 0x%08X...", __FlashAddr, __FlashLen);
                        Sequence("ExecuteCMD_FLPER");
                        Write32(__FlashAddr, 0xFFFFFFFF);
                        Sequence("ExecuteCMD_NOOP");
                    </block>
               </control>
            </sequence>
            <sequence name="FlashEraseChip">
               <block>
                    Sequence("ResetToIMode");
                    Write32(DSU_BCC0_ADDR, 0x444247E3);
                    DAP_Delay(30000);
                    Sequence("WaitBootROMStatusChallenge");
                    __var count = 0;
                </block>
               <control while="count &lt; 4">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; 0x2) == 0" timeout="10000"/>
                  <block>
                        Read32(DSU_BCC1_ADDR);
                        count = count + 1;
                    </block>
               </control>
               <control while="count &lt; 12">
                  <control while="(Read32(DSU_STATUSB_ADDR) &amp; 0x1) != 0" timeout="10000"/>
                  <block>
                        Write32(DSU_BCC0_ADDR, 0);
                        count = count + 1;
                    </block>
               </control>
               <block>
                    Sequence("WaitBootROMStatusCommandValid");
                    Sequence("WaitBootROMStatusOK");
                    Sequence("ResetToPark");
                </block>
            </sequence>
            <sequence name="FlashEraseDone"/>
            <sequence name="FlashProgramPage">
               <block>
                    __var write_size = __FlashLen;
                    __var offset = 0;
                    __var addr = __FlashAddr;
                    Message(0, "Program Page: 0x%08X..., size: 0x%08X...", __FlashAddr, __FlashLen);
                    write_size = (__FlashLen + 3) &amp; ~3;
                    Write8(RAM_BUFFER, 0);
                    FlashWriteBuffer(RAM_BUFFER, 0, write_size, (32 | 1));
                    BufferRead(0, 0x0, RAM_BUFFER, write_size, (32 | 1));
                </block>
               <control if="0x0D000400 &lt;= __FlashAddr &amp;&amp; __FlashAddr &lt;= 0x0D000500">
                  <block>
                        Sequence("ExecuteCMD_EBOOTCFG");
                        Write32(addr, 0xFFFFFFFF);
                        Sequence("ExecuteCMD_NOOP");
                        Sequence("ExecuteCMD_WBOOTCFG");
                    </block>
               </control>
               <control if="0x0D000000 &lt;= __FlashAddr &amp;&amp; __FlashAddr &lt;= 0x0D000100">
                  <block>
                        Sequence("ExecuteCMD_FLPER");
                        Write32(addr, 0xFFFFFFFF);
                        Sequence("ExecuteCMD_NOOP");
                        Sequence("ExecuteCMD_WLOCKREGION");
                    </block>
               </control>
               <control if="0x0C000000 &lt;= __FlashAddr &amp;&amp; __FlashAddr &lt;= 0x0D000000">
                  <block>
                        Sequence("ExecuteCMD_WFL");
                    </block>
               </control>
               <control while="offset &lt; write_size">
                  <block>
                        __var value = BufferGet(0, offset, 4);
                        Write32(addr + offset, value);
                        offset = offset + 4;
                    </block>
               </control>
               <block>
                    Sequence("ExecuteCMD_NOOP");
                </block>
            </sequence>
            <sequence name="FlashProgramDone"/>
         </sequences>
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0"
                            xsi:schemaLocation="http://crownking/pack-device-microchip-extension PACK.DEVICE.MICROCHIP.EXTENSION.xsd"><!--https://schemas.microchip.com/com/microchip/packs/extensions/mchp/1.0/PACK.DEVICE.MICROCHIP.EXTENSION.xsd-->
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <book name="https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ApplicationNotes/ApplicationNotes/AN6368-GettingStarted-ArmCortex-M0-PIC32CM-DS00006368.pdf"
               title="Getting Started With the Arm(R) Cortex(R)-M0+ Based PIC32CM Microcontroller Families"/>
         <book name="https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ProductDocuments/Brochures/PIC32CM-PL10-Family-DS00006268.pdf"
               title="PIC32CM-PL10 Family Sell Sheet"/>
         <book name="https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ProductDocuments/ProductBrief/PIC32CM-PL10-ProductBrief-DS40002658.pdf"
               title="PIC32CM 1216/6408/3204 PL10 Product Brief"/>
         <book name="https://developer.arm.com/documentation/dui0662"
               title="Cortex-M0+ Devices Generic User Guide"/>
         <memory name="APBA" start="0x40000000" size="0x4000" access="rwp"/>
         <memory name="APBB" start="0x41000000" size="0x10000" access="rwp"/>
         <memory name="APBC" start="0x42000000" size="0x8000" access="rwp"/>
         <memory name="IOBUS" start="0x50000000" size="0x200" access="rwp"/>
         <memory name="PPB" start="0xE0000000" size="0x100000" access="rwp"/>
         <debugport __dp="0">
            <swd/>
         </debugport>
         <trace>
            <tracebuffer/>
         </trace>
         <feature type="NVIC" n="15"/>
         <feature type="DMA" n="2"/>
         <feature type="ExtInt" n="16"/>
         <feature type="WDT" n="1"/>
         <feature type="RTC" n="1"/>
         <feature type="Timer" n="3"/>
         <feature type="PWM" n="1"/>
         <feature type="VCC" n="1.8" m="5.5"/>
         <feature type="Temp" n="-40" m="125"/>
         <feature type="AnalogOther" n="2" name="Analog Comparator"/>
         <feature type="Application"
                  n="Automotive"
                  m="ISO 26262 Compliant - ASIL B"/>
         <device Dname="PIC32CM1216PL10028">
            <processor Dcore="Cortex-M0+"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"
                       Ddsp="NO_DSP"
                       Dtz="NO_TZ"
                       Dmve="NO_MVE"
                       Dclock="24000000"
                       DcoreVersion="r0p0"/>
            <debugconfig default="swd" clock="2000000"/>
            <compile header="pic32cm1216pl/include/pic32c.h" define="__PIC32CM1216PL10028__"/>
            <debug svd="pic32cm1216pl/svd/PIC32CM1216PL10028.svd"/>
            <memory name="FLASH"
                    start="0x0C000000"
                    size="0x20000"
                    access="rx"
                    default="1"
                    startup="1"/>
            <memory name="HSRAM"
                    start="0x20000000"
                    size="0x4000"
                    default="1"
                    access="rwx"/>
            <algorithm name="keil/Flash/PIC32CM-PL_FLASH_128.FLM"
                       start="0x0C000000"
                       size="0x20000"
                       RAMstart="0x20000000"
                       RAMsize="0x2000"
                       default="1"
                       style="Keil"/>
            <algorithm name="keil/Flash/PIC32CM-PL_BOOTCFG.FLM"
                       start="0x0D000400"
                       size="0x100"
                       RAMstart="0x20000000"
                       RAMsize="0x2000"
                       default="1"
                       style="Keil"/>
            <algorithm name="keil/Flash/PIC32CM-PL_ROMCFG.FLM"
                       start="0x0D000000"
                       size="0x100"
                       RAMstart="0x20000000"
                       RAMsize="0x2000"
                       default="1"
                       style="Keil"/>
            <flashinfo name="Flash"
                       start="0x0C000000"
                       blankval="0xFFFFFFFF"
                       pagesize="0x200"
                       ptime="1000000"
                       etime="1000000">
               <block count="0x100" size="0x200"/>
            </flashinfo>
            <flashinfo name="ROMCFG"
                       start="0x0D000000"
                       blankval="0xFFFFFFFF"
                       pagesize="0x100"
                       ptime="1000000"
