sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
         <device Dname="PIC32CM3204PL10020">
            <processor Dcore="Cortex-M0+"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"
                       Ddsp="NO_DSP"
                       Dtz="NO_TZ"
                       Dmve="NO_MVE"
                       Dclock="24000000"
                       DcoreVersion="r0p0"/>
            <debugconfig default="swd" clock="2000000"/>
            <compile header="pic32cm3204pl/include/pic32c.h" define="__PIC32CM3204PL10020__"/>
            <debug svd="pic32cm3204pl/svd/PIC32CM3204PL10020.svd"/>
            <memory name="FLASH"
                    start="0x0C000000"
                    size="0x8000"
                    access="rx"
                    default="1"
                    startup="1"/>
            <memory name="HSRAM"
                    start="0x20000000"
                    size="0x1000"
                    default="1"
                    access="rwx"/>
            <algorithm name="keil/Flash/PIC32CM-PL_FLASH_32.FLM"
                       start="0x0C000000"
                       size="0x8000"
                       RAMstart="0x20000000"
                       RAMsize="0x1000"
                       default="1"
                       style="Keil"/>
            <algorithm name="keil/Flash/PIC32CM-PL_BOOTCFG.FLM"
                       start="0x0D000400"
                       size="0x100"
                       RAMstart="0x20000000"
                       RAMsize="0x1000"
                       default="1"
                       style="Keil"/>
            <algorithm name="keil/Flash/PIC32CM-PL_ROMCFG.FLM"
                       start="0x0D000000"
                       size="0x100"
                       RAMstart="0x20000000"
                       RAMsize="0x1000"
                       default="1"
                       style="Keil"/>
            <flashinfo name="Flash"
                       start="0x0C000000"
                       blankval="0xFFFFFFFF"
                       pagesize="0x200"
                       ptime="1000000"
                       etime="1000000">
               <block count="0x40" size="0x200"/>
            </flashinfo>
            <flashinfo name="ROMCFG"
                       start="0x0D000000"
                       blankval="0xFFFFFFFF"
                       pagesize="0x100"
                       ptime="1000000"
                       etime="1000000">
               <block count="0x1" size="0x100"/>
            </flashinfo>
            <flashinfo name="BOOTCFG"
                       start="0x0D000400"
                       blankval="0xFFFFFFFF"
                       pagesize="0x100"
                       ptime="1000000"
                       etime="1000000">
               <block count="0x1" size="0x100"/>
            </flashinfo>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0"
                             xsi:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"><!--https://schemas.microchip.com/com/microchip/packs/extensions/at/1.0/PACK.DEVICE.ATMEL.EXTENSION.xsd-->
                  <at:atdf name="pic32cm3204pl/atdf/PIC32CM3204PL10020.atdf"/>
                  <at:variant ordercode="PIC32CM3204PL10020-I/SS"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CM3204PL10020-E/SS"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory name="BROM"
                             start="0x00000000"
                             size="0x8000"
                             type="rom"
                             rw="R"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="FLASH"
                             start="0x0C000000"
                             size="0x8000"
                             type="flash"
                             pagesize="512"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="BOOTCFG"
                             start="0x0D000400"
                             size="0x100"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="ROMCFG"
                             start="0x0D000000"
                             size="0x100"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="SIGNATURE"
                             start="0x0D000200"
                             size="0x100"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="HSRAM"
                             start="0x20000000"
                             size="0x1000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="APBA"
                             start="0x40000000"
                             size="0x4000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBB"
                             start="0x41000000"
                             size="0x10000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="APBC"
                             start="0x42000000"
                             size="0x8000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="IOBUS"
                             start="0x50000000"
                             size="0x200"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x100000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0"
                               xsi:schemaLocation="http://crownking/pack-device-microchip-extension PACK.DEVICE.MICROCHIP.EXTENSION.xsd"><!--https://schemas.microchip.com/com/microchip/packs/extensions/mchp/1.0/PACK.DEVICE.MICROCHIP.EXTENSION.xsd-->
                  <mchp:pic name="pic32cm3204pl/edc/PIC32CM3204PL10020.PIC"/>
                  <mchp:xc32 name="pic32cm3204pl/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="pic32cm3204pl/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="pic32cm3204pl/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="pic32cm3204pl/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="pic32cm3204pl/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>&lt;p&gt;The PIC32CM3204PL10020 is a part of the PIC32CM PL10 family of microcontrollers and features the Arm(R) Cortex(R)-M0+ runn...</description>
            <book name="https://www.microchip.com/en-us/product/PIC32CM3204PL10020"
                  title="Device page for PIC32CM3204PL10020"/>
            <book name="https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ProductDocuments/DataSheets/PIC32CM3204PL10-020-028-032-DataSheet-DS40002691.pdf"
                  title="PIC32CM3204PL10020/028/032 Data Sheet"/>
            <book name="https://ww1.microchip.com/downloads/aemDocuments/documents/MCU32/ProductDocuments/Errata/PIC32CM3204PL10-020-028-032-Errata-DS80001216.pdf"
                  title="PIC32CM3204PL10020/28/32 SEDSC"/>
            <feature type="ADC" n="11" m="12"/>
            <feature type="Touch" n="11" name="Capacitive Touch pins"/>
            <feature type="IOs" n="17"/>
            <feature type="SOP" n="20"/>
            <feature type="Other" n="4" name="Multi-Voltage I/O Pins"/>
         </device>
