sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
      <condition id="GCC+CLANG Exe">
         <require condition="GCC+CLANG"/>
         <accept Toutput="exe"/>
      </condition>
      <condition id="GCC+CLANG Lib">
         <require condition="GCC+CLANG"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <require condition="IAR"/>
         <accept Toutput="exe"/>
      </condition>
      <condition id="IAR Lib">
         <require condition="IAR"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="XC">
         <accept Tcompiler="XC"/>
      </condition>
      <condition id="XC Exe">
         <require condition="XC"/>
         <accept Toutput="exe"/>
      </condition>
      <condition id="XC Lib">
         <require condition="XC"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="C">
         <accept condition="ARMCC"/>
         <accept condition="GCC+CLANG"/>
         <accept condition="IAR"/>
         <accept condition="XC"/>
      </condition>
      <condition id="C Exe">
         <accept condition="ARMCC Exe"/>
         <accept condition="GCC+CLANG Exe"/>
         <accept condition="IAR Exe"/>
         <accept condition="XC Exe"/>
      </condition>
      <condition id="C Lib">
         <accept condition="ARMCC Lib"/>
         <accept condition="GCC+CLANG Lib"/>
         <accept condition="IAR Lib"/>
         <accept condition="XC Lib"/>
      </condition>
      <condition id="PIC32CM1216PL10028">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216PL10028"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216PL10032">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216PL10032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216PL10048">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216PL10048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1216PL10064">
         <require Dvendor="Microchip:3" Dname="PIC32CM1216PL10064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204PL10020">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204PL10020"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204PL10028">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204PL10028"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204PL10032">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204PL10032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408PL10028">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408PL10028"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408PL10032">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408PL10032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408PL10048">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408PL10048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM6408PL10064">
         <require Dvendor="Microchip:3" Dname="PIC32CM6408PL10064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM1216PL10028">
         <description>Headers and startup code for Microchip PIC32CM1216PL10028</description>
         <files>
            <file condition="C" category="include" name="pic32cm1216pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm1216pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/gcc/startup_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10028_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10028_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/armcc/startup_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/system_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10028_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10028_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/iar/startup_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/system_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10028/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10028/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10028/startup_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10028/PIC32CM1216PL10028.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM1216PL10032">
         <description>Headers and startup code for Microchip PIC32CM1216PL10032</description>
         <files>
            <file condition="C" category="include" name="pic32cm1216pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm1216pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/gcc/startup_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10032_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10032_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/armcc/startup_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/system_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10032_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10032_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/iar/startup_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/system_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10032/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10032/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10032/startup_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10032/PIC32CM1216PL10032.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM1216PL10048">
         <description>Headers and startup code for Microchip PIC32CM1216PL10048</description>
         <files>
            <file condition="C" category="include" name="pic32cm1216pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm1216pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/gcc/startup_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10048_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10048_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/armcc/startup_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/system_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10048_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10048_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/iar/startup_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/system_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10048/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10048/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10048/startup_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10048/PIC32CM1216PL10048.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM1216PL10064">
         <description>Headers and startup code for Microchip PIC32CM1216PL10064</description>
         <files>
            <file condition="C" category="include" name="pic32cm1216pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm1216pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm1216pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm1216pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/gcc/startup_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10064_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/gcc/gcc/pic32cm1216pl10064_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/armcc/startup_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm1216pl/armcc/system_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10064_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/armcc/armcc/pic32cm1216pl10064_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/iar/startup_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm1216pl/iar/system_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10064/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/iar/config/linker/Microchip/pic32cm1216pl10064/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10064/startup_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm1216pl/gcc/system_pic32cm1216pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm1216pl/xc32/PIC32CM1216PL10064/PIC32CM1216PL10064.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
