sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM3204PL10020">
         <description>Headers and startup code for Microchip PIC32CM3204PL10020</description>
         <files>
            <file condition="C" category="include" name="pic32cm3204pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm3204pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/gcc/startup_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10020_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10020_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/armcc/startup_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/system_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10020_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10020_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/iar/startup_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/system_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10020/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10020/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10020/startup_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10020.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10020/PIC32CM3204PL10020.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM3204PL10028">
         <description>Headers and startup code for Microchip PIC32CM3204PL10028</description>
         <files>
            <file condition="C" category="include" name="pic32cm3204pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm3204pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/gcc/startup_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10028_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10028_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/armcc/startup_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/system_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10028_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10028_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/iar/startup_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/system_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10028/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10028/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10028/startup_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10028/PIC32CM3204PL10028.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM3204PL10032">
         <description>Headers and startup code for Microchip PIC32CM3204PL10032</description>
         <files>
            <file condition="C" category="include" name="pic32cm3204pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm3204pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm3204pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm3204pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/gcc/startup_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10032_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/gcc/gcc/pic32cm3204pl10032_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/armcc/startup_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm3204pl/armcc/system_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10032_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/armcc/armcc/pic32cm3204pl10032_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/iar/startup_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm3204pl/iar/system_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10032/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/iar/config/linker/Microchip/pic32cm3204pl10032/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10032/startup_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm3204pl/gcc/system_pic32cm3204pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm3204pl/xc32/PIC32CM3204PL10032/PIC32CM3204PL10032.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM6408PL10028">
         <description>Headers and startup code for Microchip PIC32CM6408PL10028</description>
         <files>
            <file condition="C" category="include" name="pic32cm6408pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm6408pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/gcc/startup_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10028_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10028_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/armcc/startup_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/system_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10028_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10028_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/iar/startup_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/system_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10028/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10028/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10028/startup_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10028.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10028/PIC32CM6408PL10028.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
