sebasthg/cmsis-pdsc-parser/tests/PIC32CM_PL/pdsc/Microchip.PIC32CM-PL_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM6408PL10032">
         <description>Headers and startup code for Microchip PIC32CM6408PL10032</description>
         <files>
            <file condition="C" category="include" name="pic32cm6408pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm6408pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/gcc/startup_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10032_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10032_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/armcc/startup_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/system_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10032_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10032_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/iar/startup_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/system_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10032/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10032/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10032/startup_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10032.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10032/PIC32CM6408PL10032.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM6408PL10048">
         <description>Headers and startup code for Microchip PIC32CM6408PL10048</description>
         <files>
            <file condition="C" category="include" name="pic32cm6408pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm6408pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/gcc/startup_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10048_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10048_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/armcc/startup_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/system_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10048_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10048_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/iar/startup_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/system_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10048/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10048/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10048/startup_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10048.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10048/PIC32CM6408PL10048.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.5.0"
                 condition="PIC32CM6408PL10064">
         <description>Headers and startup code for Microchip PIC32CM6408PL10064</description>
         <files>
            <file condition="C" category="include" name="pic32cm6408pl/include/"/>
            <file condition="C"
                  category="header"
                  name="pic32cm6408pl/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="pic32cm6408pl/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="pic32cm6408pl/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/gcc/startup_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10064_flash.ld"
                  version="1.5.0"
                  attr="config"/>
            <file condition="GCC+CLANG Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/gcc/gcc/pic32cm6408pl10064_sram.ld"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/armcc/startup_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="pic32cm6408pl/armcc/system_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10064_flash.sct"
                  version="1.5.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/armcc/armcc/pic32cm6408pl10064_sram.sct"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/iar/startup_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="pic32cm6408pl/iar/system_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10064/sram.icf"
                  version="1.5.0"
                  attr="template"
                  select="SRAM linker script"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/iar/config/linker/Microchip/pic32cm6408pl10064/flash.icf"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10064/startup_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="pic32cm6408pl/gcc/system_pic32cm6408pl10064.c"
                  version="1.5.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="linkerScript"
                  name="pic32cm6408pl/xc32/PIC32CM6408PL10064/PIC32CM6408PL10064.ld"
                  version="1.5.0"
                  attr="config"/>
         </files>
      </component>
   </components>
   <csolution>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM1216PL10028"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM1216PL10028">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM1216PL10032"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM1216PL10032">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM1216PL10048"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM1216PL10048">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM1216PL10064"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM1216PL10064">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM3204PL10020"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM3204PL10020">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM3204PL10028"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM3204PL10028">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM3204PL10032"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM3204PL10032">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM6408PL10028"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM6408PL10028">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM6408PL10032"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM6408PL10032">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM6408PL10048"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM6408PL10048">
         <description>Create a basic project with empty main function</description>
      </template>
      <template name="Blank Solution"
                path="templates/csolution/PIC32CM6408PL10064"
                file="Blank.csolution.yml"
                copy-to="blank"
                condition="PIC32CM6408PL10064">
         <description>Create a basic project with empty main function</description>
      </template>
   </csolution>
   <taxonomy>
      <description Cclass="Device" Cgroup="Startup">Device specific startup components</description>
   </taxonomy>
</package>
